jacob-heathorn/mimxrt1170evk/firmware/cm7/rtos/netxduo/nx_driver_imxrt.cpp
        if( config->speed == kPHY_Speed1000M )
        {
            ecr |= ENET_ECR_SPEED_MASK;
        }
        else
        {
            ecr &= ~ENET_ECR_SPEED_MASK;
        }

        /* use Round-robin scheme for legacy buffer descriptor mode */
        EXAMPLE_ENET->QOS |= ENET_QOS_TX_SCHEME(1);
    }
#endif

    if ( config->interface == kENET_RmiiMode )
    {
        rcr |= ENET_RCR_RMII_MODE_MASK;

        /*only set speed in RMII mode*/
        if( config->speed == kPHY_Speed10M )
        {
            rcr |= ENET_RCR_RMII_10T_MASK;
        }
    }/*no need to configure MAC MII interface*/

    /* Set the duplex */
    switch (config->duplex)
    {
        case kENET_MiiHalfDuplex:
            rcr |= ENET_RCR_DRT_MASK;
            tcr &= (uint32_t)~ENET_TCR_FDEN_MASK;
            break;
        case kENET_MiiFullDuplex:
        default:
            rcr &= ~ENET_RCR_DRT_MASK;
            tcr |= ENET_TCR_FDEN_MASK;
            break;
    }

#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
    ecr |= ENET_ECR_EN1588_MASK;
#endif

#ifdef IMX_CHECKSUM_OFFLOAD
    EXAMPLE_ENET->TACC = ENET_TACC_SHIFT16_MASK |
                ENET_TACC_IPCHK_MASK   |
                ENET_TACC_PROCHK_MASK;

    EXAMPLE_ENET->TFWR = ENET_TFWR_STRFWD_MASK;

    EXAMPLE_ENET->RACC = ENET_RACC_SHIFT16_MASK |
                ENET_RACC_LINEDIS_MASK |
                ENET_RACC_PRODIS_MASK  |
                ENET_RACC_IPDIS_MASK;
#else
    EXAMPLE_ENET->TACC = ENET_TACC_SHIFT16_MASK;

    EXAMPLE_ENET->RACC = ENET_RACC_SHIFT16_MASK |
                ENET_RACC_LINEDIS_MASK;
#endif

    EXAMPLE_ENET->RCR = rcr;
    EXAMPLE_ENET->ECR = ecr;
    EXAMPLE_ENET->TCR = tcr;
}

static void enet_init(void)
{
    phy_config_t phyConfig = {};
    bool link              = false;
    bool autonego          = false;
    uint32_t count         = 0;
    status_t status;
    phy_speed_t speed;
    phy_duplex_t duplex;
    ENET_CONFIG_IMX econf;

    g_phy_resource.read  = MDIO_Read;
    g_phy_resource.write = MDIO_Write;

    ethernet::detail::GigabitMac::instance().mdioInit();

    econf.interface = kENET_RgmiiMode;

    econf.neg = 0; /*autoneg on */
    econf.mac[0] = _nx_driver_hardware_address[0];
    econf.mac[1] = _nx_driver_hardware_address[1];
    econf.mac[2] = _nx_driver_hardware_address[2];
    econf.mac[3] = _nx_driver_hardware_address[3];
    econf.mac[4] = _nx_driver_hardware_address[4];
    econf.mac[5] = _nx_driver_hardware_address[5];

    phyConfig.phyAddr  = EXAMPLE_PHY_ADDRESS;
    phyConfig.autoNeg  = true;
    phyConfig.ops      = EXAMPLE_PHY_OPS;
    phyConfig.resource = EXAMPLE_PHY_RESOURCE;

    /* Initialize PHY and wait auto-negotiation over. */
    do
    {
        status = PHY_Init(&phyHandle, &phyConfig);
        if (status == kStatus_Success)
        {
            /* Wait for auto-negotiation success and link up */
            count = PHY_AUTONEGO_TIMEOUT_COUNT;
            do
            {
                PHY_GetAutoNegotiationStatus(&phyHandle, &autonego);
                PHY_GetLinkStatus(&phyHandle, &link);
                if (autonego && link)
                {
                    break;
                }
            } while (--count);
            if (!autonego)
            {
                printf("PHY Auto-negotiation failed. Please check the cable connection and link partner setting.\r\n");
            }
        }
    } while (!(link && autonego));


    PHY_GetLinkSpeedDuplex(&phyHandle, &speed, &duplex);
    econf.speed = speed;
    econf.duplex = duplex;

   enet_init_imx(&econf);
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _nx_driver_hardware_initialize                      PORTABLE C      */
/*                                                           5.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function processes hardware-specific initialization.           */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    driver_req_ptr                        Driver request pointer        */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    ETH_BSP_Config                        Configure Ethernet            */
/*    ETH_MACAddressConfig                  Setup MAC address             */
/*    ETH_DMARxDescReceiveITConfig          Enable receive descriptors    */
/*    nx_packet_allocate                    Allocate receive packet(s)    */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    _nx_driver_initialize                 Driver initialize processing  */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */
/*                                                                        */
/**************************************************************************/
static UINT  _nx_driver_hardware_initialize(NX_IP_DRIVER *driver_req_ptr)
{

UINT                i;

    /* Default to successful return.  */
    driver_req_ptr -> nx_ip_driver_status =  NX_SUCCESS;

    /* Make sure there are receive packets... otherwise, return an error.  */
    if (nx_driver_information.nx_driver_information_packet_pool_ptr == NULL)
    {
        /* There must be receive packets. If not, return an error!  */
        return(NX_DRIVER_ERROR);
    }

    /* Call base Ethernet initialization */
    enet_init();
    GigabitEthernetDriver::instance().initialize();

    /******************** RX Initialization ********************/

    /* Setup RX index.  */
    nx_driver_information.nx_driver_information_receive_current_index = 0;

    /* Initialize RX Descriptors list: Ring Mode  */

