jacob-heathorn/mimxrt1170evk/firmware/cm7/rtos/netxduo/nx_driver_imxrt.cpp
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    _nx_driver_disable                    Driver link disable processing*/
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */
/*                                                                        */
/**************************************************************************/
static UINT  _nx_driver_hardware_disable(NX_IP_DRIVER *driver_req_ptr)
{

    DisableIRQ(EXAMPLE_INT);

    /* Stop the Ethernet.  */
    EXAMPLE_ENET->ECR &= ~ENET_ECR_ETHEREN_MASK;

    /* Return success!  */
    return(NX_SUCCESS);
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _nx_driver_hardware_packet_send                     PORTABLE C      */
/*                                                           5.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function processes hardware-specific packet send requests.     */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    packet_ptr                            Pointer to packet to send     */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    [_nx_driver_transmit_packet_enqueue]  Optional internal transmit    */
/*                                            packet queue routine        */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    _nx_driver_packet_send                Driver packet send processing */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */
/*                                                                        */
/**************************************************************************/
static UINT  _nx_driver_hardware_packet_send(NX_PACKET *packet_ptr)
{
    /* The C++ GigabitEthernetDriver does not support chained packets.
       Ensure the packet is not chained before passing to the driver. */
    assert(packet_ptr->nx_packet_next == NX_NULL &&
           "GigabitEthernetDriver does not support chained packets");

    /* Convert NX_PACKET to ethernet::Frame and send via C++ driver */
    NX_PACKET* packet = static_cast<NX_PACKET*>(packet_ptr);

    // This driver does not support chained packets
    assert(packet->nx_packet_next == nullptr && "Driver does not support chained packets");

    // Calculate frame size from packet pointers
    size_t packet_size = packet->nx_packet_append_ptr - packet->nx_packet_prepend_ptr;

    // Create ethernet::Frame with 2-byte padding for hardware requirement
    ethernet::Frame frame(packet_size + 2);

    // Copy packet data starting at offset 2
    std::memcpy(frame.front() + 2, packet->nx_packet_prepend_ptr, packet_size);

    // Pass the frame to the driver
    bool success = GigabitEthernetDriver::instance().send(std::move(frame));

    if (success) {
        // Remove the Ethernet header that was added by _nx_driver_packet_send()
        // before releasing the packet back to the pool
        NX_DRIVER_ETHERNET_HEADER_REMOVE(packet);

        // Release the original packet immediately since Frame has copied the data
        nx_packet_transmit_release(packet);
    }

    return success ? NX_SUCCESS : NX_DRIVER_ERROR;
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*    nx_crc32()                                         PORTABLE C       */
/*                                                           1.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    SK - Microsoft Corporation                                          */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    Calculate 32bit CRC using reversed Poly for Ethernet.               */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    UCHAR dbuf[]  - pointer to the data buffer.                         */
/*    INT length    - Length of the data                                  */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    CRC value                                                           */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    _nx_driver_hardware_multicast_join                                  */
/*    _nx_driver_hardware_multicast_leave                                 */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  03-09-2007           SK                    Initial Version 1.0        */
/*                                                                        */
/**************************************************************************/
static ULONG  nx_crc32(UCHAR dbuf[], INT length)
{

INT             i;
INT             bit;
ULONG           crc  = 0xFFFFFFFFUL;
ULONG           poly = 0xEDB88320UL;
ULONG           p;
ULONG           data;


    for (i = 0; i < length; i++)
    {
        data = ((ULONG)dbuf[i]);

        for (bit = 0; bit < 8; bit++)
        {
            p   = (crc ^ ((ULONG)data)) & 1UL;
            crc >>= 1;
            if (p != 0)
                crc ^= poly;
            data >>= 1;
        }
    }

