jacob-heathorn/mimxrt1170evk/firmware/cm7/rtos/netxduo/nx_driver_imxrt.cpp
        // Ensure packet buffer is large enough
        if (static_cast<size_t>(packet_ptr->nx_packet_data_end - packet_ptr->nx_packet_prepend_ptr) < frame.size()) {
            // Packet buffer too small - this shouldn't happen with proper configuration
            nx_packet_release(packet_ptr);
            frame = GigabitEthernetDriver::instance().receive();
            continue;
        }

        // Copy the frame data to the NX_PACKET
        std::memcpy(packet_ptr->nx_packet_prepend_ptr, frame.front(), frame.size());
        packet_ptr->nx_packet_length = frame.size();
        packet_ptr->nx_packet_append_ptr = packet_ptr->nx_packet_prepend_ptr + frame.size();

        /* Transfer the received packet to NetX */
        /* NetX takes ownership of the packet - do NOT release it here */
        _nx_driver_transfer_to_netx(nx_driver_information.nx_driver_information_ip_ptr, packet_ptr);

        // Get the next frame
        frame = GigabitEthernetDriver::instance().receive();
    }
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_driver_imx_ethernet_isr                          PORTABLE C      */
/*                                                           5.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function processing incoming packets.  This routine is         */
/*    be called from the receive packet ISR and assumes that the          */
/*    interrupt is saved/restored around the call by ThreadX.             */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    _nx_ip_driver_deferred_processing     IP receive packet processing  */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    ISR                                                                 */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */
/*                                                                        */
/**************************************************************************/
extern "C" VOID  nx_driver_imx_ethernet_isr(VOID)
{
  UINT status;
  status = EXAMPLE_ENET->EIR;

  if(status & ENET_EIR_RXF_MASK )
  {
    /* Receive packet interrupt.  */

    /* Set the receive packet interrupt.  */
    nx_driver_information.nx_driver_information_deferred_events |= NX_DRIVER_DEFERRED_PACKET_RECEIVED;



    /* Call NetX deferred driver processing.  */
    _nx_ip_driver_deferred_processing(nx_driver_information.nx_driver_information_ip_ptr);

    /* Clear the Ethernet DMA Rx IT pending bits */
    EXAMPLE_ENET->EIR = ENET_EIR_RXF_MASK;
  }
  if(status & ENET_EIR_TXF_MASK)
  {

     EXAMPLE_ENET->TDAR = ENET_TDAR_TDAR_MASK;


    /* Set the transmit complete bit.  */
    nx_driver_information.nx_driver_information_deferred_events |= NX_DRIVER_DEFERRED_PACKET_TRANSMITTED;


    /* Call NetX deferred driver processing.  */
    _nx_ip_driver_deferred_processing(nx_driver_information.nx_driver_information_ip_ptr);

    /* Clear the Eth DMA Tx IT pending bit.  */
    EXAMPLE_ENET->EIR = ENET_EIR_TXF_MASK;
  }
}

/****** DRIVER SPECIFIC ****** Start of part/vendor specific internal driver functions.  */
